Project/Toir/src/InformationRegisters/торо_СеансыОбменаСАСУТП/торо_СеансыОбменаСАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СеансыОбменаСАСУТП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЗагруженныхЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ДанныеАСУТП/торо_ДанныеАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ДанныеАСУТП</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеткаВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СобытияИнтеграцииСАСУТП/торо_СобытияИнтеграцииСАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СобытияИнтеграцииСАСУТП</name>
  <resources>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </resources>
  <resources>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.торо_СобытияИнтеграции</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.торо_ОшибкиАСУТП</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИДСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СозданныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ТегиПоказателей/гкс_ТегиПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТегиПоказателей</name>
  <resources>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ТегиНаработки/гкс_ТегиНаработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТегиНаработки</name>
  <resources>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ОрганизацииПодключений/гкс_ОрганизацииПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ОрганизацииПодключений</name>
  <resources>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.торо_ПодключенияКБазеДанных</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ОшибкиАСУТП/торо_ОшибкиАСУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ОшибкиАСУТП</name>
  <enumValues>
    <name>Подключение</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеДанных</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеДанныхИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ГенерацияИЗаписьНовыхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеНовыхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЧтениеДанныхИзМакета</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_СобытияИнтеграции/торо_СобытияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СобытияИнтеграции</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ПодключенияКБазеДанных/торо_ПодключенияКБазеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПодключенияКБазеДанных</name>
  <predefined>
    <items>
      <name>гкс_ПолучениеДанныхКП</name>
      <description>Получение данных КП</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхКПБел</name>
      <description>Получение данных КП Беларусь</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхНаработки</name>
      <description>Получение данных наработки</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхНаработкиБел</name>
      <description>Получение данных наработки Беларусь</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхКПКурск</name>
      <description>Получение данных КП Курск</description>
    </items>
    <items>
      <name>гкс_ПолучениеДанныхНаработкиКурск</name>
      <description>Получение данных наработки Курск</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПолученияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаЧтения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаПометкиОбрабатываемых</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаУдаленияОбработанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПометкуДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУдалениеДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеРазбиениеДанныхНаПорции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПорцияДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СписокТегов</name>
    <comment>параметр запроса = &quot;СписокТегов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/CommonModules/гкс_ПолучениеДанныхАСУТП/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Вызывается обработчиком регламентного задания гкс_ИнтеграцияСАСУТП.
//
Процедура гкс_ИнтеграцияСАСУТП() Экспорт

	ИспользоватьИнтеграциюСАСУТП = Константы.торо_ПоказыватьПодсистемуИнтеграцияАСУТП.Получить();
	Если ИспользоватьИнтеграциюСАСУТП = Ложь Тогда
		Возврат;
	КонецЕсли;

	гкс_ПолучитьДанные();
	торо_ОбработкаДанныхАСУТП.ОбработатьДанные();

КонецПроцедуры


// Получает данные из Historian по настройкам из справочника торо_ПодключенияКБазеДанных.
//
Процедура гкс_ПолучитьДанные() Экспорт

	МассивПодключений = Новый Массив;
	МассивПодключений.Добавить(Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхКП);
	МассивПодключений.Добавить(Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхНаработки);
	МассивПодключений.Добавить(Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхКПБел);
	МассивПодключений.Добавить(Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхНаработкиБел);
	МассивПодключений.Добавить(Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхКПКурск);
	МассивПодключений.Добавить(Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхНаработкиКурск);

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПодключенийКБазеДанных();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Подключение", МассивПодключений);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ИсточникиДанных = РезультатЗапроса.Выбрать();

	Ошибка = Ложь;
	Пока ИсточникиДанных.Следующий() Цикл
		ПодключитьсяИВыполнитьЗапрос(ИсточникиДанных, Ошибка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодключитьсяИВыполнитьЗапрос(ТекИсточник, Ошибка)

	ИДСеанса = Новый УникальныйИдентификатор;
	Этап = Перечисления.торо_ОшибкиАСУТП.Подключение;
	КоличествоЗагруженныхЗаписей = 0;
	ТекущаяДата = ТекущаяДата();
	ОтступВСекундах = Константы.торо_ОтступВСекундахАСУТП.Получить();
	МинДатаОбмена = Константы.гкс_МинимальнаяДатаОбменаАСУТП.Получить();
	МаксДатаОбмена = НачалоДня(ТекущаяДата);
	Порция = ТекИсточник.РазмерПорции;

	ГраницаПолученияДанныхНачало = Дата(1, 1, 1);
	ГраницаПолученияДанныхКонец = Дата(1, 1, 1);
	ПолучитьГраницыДанных(ТекИсточник, ГраницаПолученияДанныхНачало, ГраницаПолученияДанныхКонец, 
		МинДатаОбмена, Порция);
		
	Попытка
		
		ТаблицаДанных = ИнициализироватьТаблицуДляПолученныхДанных();
		КоличествоЗагруженныхЗаписей = 0;
		ФлагОкончания = Ложь;
		ПоследняяМаксимальнаяДата = ГраницаПолученияДанныхНачало;
		ЭтоПолучениеПоказателей = ПроверитьПолучениеПоказателей(ТекИсточник.Подключение);
		Теги = ЗаполнитьМассивТегов(ЭтоПолучениеПоказателей, ТекИсточник.Подключение);

		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Таймаут = 300;
		Порт = 443;
		Соединение = Новый HTTPСоединение(ТекИсточник.Адрес, Порт, , , , Таймаут, ЗащищенноеСоединение, Истина);

		ДанныеПолучены = Ложь;
		
		Пока ФлагОкончания = Ложь Цикл

			Если ТекИсточник.ИспользованиеРазбиениеДанныхНаПорции Тогда
				Если ТекИсточник.гкс_ПорцияДень Тогда
					Если ГраницаПолученияДанныхКонец > МаксДатаОбмена Тогда
						Прервать;
					КонецЕсли;
					ТемпДата = ГраницаПолученияДанныхНачало + 1;
					ГраницаПолученияДанныхНачало = НачалоДня(ТемпДата);
					ГраницаПолученияДанныхКонец = КонецДня(ТемпДата) + 1;
					ФлагОкончания = ГраницаПолученияДанныхКонец >= ТекущаяДата - ОтступВСекундах
						Или ГраницаПолученияДанныхКонец >= МаксДатаОбмена;
				Иначе
					ГраницаПолученияДанныхКонец = ГраницаПолученияДанныхНачало + Порция;
					ФлагОкончания = ГраницаПолученияДанныхКонец >= ТекущаяДата - ОтступВСекундах;
					ГраницаПолученияДанныхКонец = Мин(ГраницаПолученияДанныхКонец, ТекущаяДата - ОтступВСекундах);
				КонецЕсли;

				Запрос = HTTPЗапросКСервису(ТекИсточник.ТекстЗапросаЧтения, Теги, ГраницаПолученияДанныхНачало,
					ГраницаПолученияДанныхКонец);
				Ответ = Соединение.ОтправитьДляОбработки(Запрос);

				ДанныеПолучены = ОбработатьHTTPОтвет(Ответ, ТаблицаДанных, ГраницаПолученияДанныхНачало,
					ГраницаПолученияДанныхКонец, ПоследняяМаксимальнаяДата, ЭтоПолучениеПоказателей, ФлагОкончания);

			КонецЕсли;

			ГраницаПолученияДанныхНачало = Мин(ПоследняяМаксимальнаяДата, ГраницаПолученияДанныхКонец);

		КонецЦикла;

		ЗаписатьДанныеАСУТП(ТаблицаДанных, ТекИсточник.Подключение, ИДСеанса, КоличествоЗагруженныхЗаписей,
			ДанныеПолучены);

	Исключение
		Ошибка = Истина;
		КоличествоЗагруженныхЗаписей = 0;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"),
			УровеньЖурналаРегистрации.Предупреждение, , , ОписаниеОшибки);
		ЗарегистрироватьОшибкуИнтеграции(ТекИсточник, Этап, ОписаниеОшибки, ИДСеанса);
	КонецПопытки;

	СделатьЗаписьВРегистрСеансов(ТекИсточник, КоличествоЗагруженныхЗаписей, ТекущаяДата);

КонецПроцедуры

Функция ТекстЗапросаПодключенийКБазеДанных()

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключенияКБазеДанных.Сервер КАК Адрес,
	|	ПодключенияКБазеДанных.БазаДанных КАК ИмяБД,
	|	ПодключенияКБазеДанных.Логин КАК Логин,
	|	ПодключенияКБазеДанных.Пароль КАК Пароль,
	|	ПодключенияКБазеДанных.Ссылка КАК Ссылка,
	|	ПодключенияКБазеДанных.ПериодПолученияДанных КАК ПериодПолученияДанных,
	|	ПодключенияКБазеДанных.ТекстЗапросаЧтения КАК ТекстЗапросаЧтения,
	|	ПодключенияКБазеДанных.ТекстЗапросаПометкиОбрабатываемых КАК ТекстЗапросаПометки,
	|	ПодключенияКБазеДанных.ТекстЗапросаУдаленияОбработанных КАК ТекстЗапросаУдаления,
	|	ПодключенияКБазеДанных.ИспользоватьПометкуДанных КАК ИспользоватьПометкуДанных,
	|	ПодключенияКБазеДанных.ИспользоватьУдалениеДанных КАК ИспользоватьУдалениеДанных,
	|	ПодключенияКБазеДанных.ИспользованиеРазбиениеДанныхНаПорции КАК ИспользованиеРазбиениеДанныхНаПорции,
	|	ПодключенияКБазеДанных.гкс_ПорцияДень КАК гкс_ПорцияДень,
	|	ПодключенияКБазеДанных.РазмерПорции КАК РазмерПорции
	|ПОМЕСТИТЬ Источники
	|ИЗ
	|	Справочник.торо_ПодключенияКБазеДанных КАК ПодключенияКБазеДанных
	|ГДЕ
	|	НЕ ПодключенияКБазеДанных.ПометкаУдаления
	|	И НЕ ПодключенияКБазеДанных.Отключен
	|	И ПодключенияКБазеДанных.Ссылка В (&Подключение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СеансыОбменаСрезПоследних.Период КАК Период,
	|	СеансыОбменаСрезПоследних.Подключение КАК Подключение
	|ПОМЕСТИТЬ Сеансы
	|ИЗ
	|	РегистрСведений.торо_СеансыОбменаСАСУТП.СрезПоследних КАК СеансыОбменаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Источники.Адрес КАК Адрес,
	|	Источники.ИмяБД КАК ИмяБД,
	|	Источники.Логин КАК Логин,
	|	Источники.Пароль КАК Пароль,
	|	Источники.Ссылка КАК Подключение,
	|	Источники.Ссылка.Наименование КАК НаименованиеПодключения,
	|	Источники.ТекстЗапросаЧтения КАК ТекстЗапросаЧтения,
	|	Источники.ТекстЗапросаПометки КАК ТекстЗапросаПометки,
	|	Источники.ТекстЗапросаУдаления КАК ТекстЗапросаУдаления,
	|	Источники.ИспользоватьПометкуДанных КАК ИспользоватьПометкуДанных,
	|	Источники.ИспользоватьУдалениеДанных КАК ИспользоватьУдалениеДанных,
	|	ЕСТЬNULL(Сеансы.Период, ДАТАВРЕМЯ(1980, 1, 1, 0, 0, 0)) КАК ДатаПрошлогоСеанса,
	|	Источники.ИспользованиеРазбиениеДанныхНаПорции КАК ИспользованиеРазбиениеДанныхНаПорции,
	|	Источники.РазмерПорции КАК РазмерПорции,
	|	Источники.гкс_ПорцияДень КАК гкс_ПорцияДень
	|ИЗ
	|	Источники КАК Источники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сеансы КАК Сеансы
	|		ПО Источники.Ссылка = Сеансы.Подключение
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(ЕСТЬNULL(Сеансы.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), СЕКУНДА,
	|		Источники.ПериодПолученияДанных) < &ТекущаяДата";

КонецФункции

Процедура ПолучитьГраницыДанных(ТекИсточник, ГраницаПолученияДанныхНачало, ГраницаПолученияДанныхКонец, МинДатаОбмена,
	Порция)

	Если ТекИсточник.ИспользованиеРазбиениеДанныхНаПорции Тогда
		Если ТекИсточник.гкс_ПорцияДень = Истина Тогда
			ТемпДата = Макс(ТекИсточник.ДатаПрошлогоСеанса, МинДатаОбмена);
			ГраницаПолученияДанныхНачало = НачалоДня(ТемпДата);
			ГраницаПолученияДанныхКонец = КонецДня(ТемпДата) + 1;
		Иначе
			ГраницаПолученияДанныхНачало = Макс(ТекИсточник.ДатаПрошлогоСеанса, МинДатаОбмена);
			ГраницаПолученияДанныхКонец = ГраницаПолученияДанныхНачало + Порция;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьПолучениеПоказателей(Подключение)

	Возврат Подключение = Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхКП 
		Или Подключение = Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхКПБел 
		Или Подключение = Справочники.торо_ПодключенияКБазеДанных.гкс_ПолучениеДанныхКПКурск;

КонецФункции

Функция ИнициализироватьТаблицуДляПолученныхДанных()
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НаименованиеОР", Новый ОписаниеТипов("Строка", , , ,
		Новый КвалификаторыСтроки(100)));
	ТаблицаДанных.Колонки.Добавить("Тег", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
	ТаблицаДанных.Колонки.Добавить("Подключение", Новый ОписаниеТипов("СправочникСсылка.торо_ПодключенияКБазеДанных"));
	ТаблицаДанных.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , , ,
		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДанных.Колонки.Добавить("МеткаВремени", Новый ОписаниеТипов("Дата", , , , ,
		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДанных.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 3)));
	ТаблицаДанных.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Обработан", Новый ОписаниеТипов("Булево"));

	Возврат ТаблицаДанных;
КонецФункции

Функция ОбработатьHTTPОтвет(Ответ, ТаблицаДанных, ГраницаПолученияДанныхНачало, ГраницаПолученияДанныхКонец,
							ПоследняяМаксимальнаяДата, ЭтоПолучениеПоказателей, ФлагОкончания)

	ДанныеПолучены = Ложь;

	Если Ответ.КодСостояния = 200 Тогда
		ОтветИтог = Ответ.ПолучитьТелоКакСтроку();

		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ОтветИтог);

		Данные = ПрочитатьJSON(Чтение, , , ФорматДатыJSON.JavaScript);

		Если Данные.Количество() Тогда
			Для Каждого Элем Из Данные Цикл
				НоваяСтрока = ТаблицаДанных.Добавить();
				НоваяСтрока.НаименованиеОР = Элем.tagName;
				НоваяСтрока.Тег = Элем.tagName;
				НоваяСтрока.Дата = НачалоДня(ГраницаПолученияДанныхНачало);
				Если ЭтоПолучениеПоказателей Тогда
					НоваяСтрока.Значение = Элем.minimum;
					НоваяСтрокаМакс = ТаблицаДанных.Добавить();
					НоваяСтрокаМакс.НаименованиеОР = Элем.tagName;
					НоваяСтрокаМакс.Тег = Элем.tagName;
					НоваяСтрокаМакс.Дата = КонецДня(ГраницаПолученияДанныхНачало);
					НоваяСтрокаМакс.Значение = Элем.maximum;
				Иначе
					НоваяСтрока.Значение = Элем.stateTime;
				КонецЕсли;
				ПоследняяМаксимальнаяДата = Макс(ПоследняяМаксимальнаяДата, КонецДня(НоваяСтрока.Дата));
				ДанныеПолучены = Истина;

			КонецЦикла;
		Иначе
			ПоследняяМаксимальнаяДата = ГраницаПолученияДанныхКонец;
		КонецЕсли;
	Иначе
		ФлагОкончания = Истина;
	КонецЕсли;

	Возврат ДанныеПолучены;

КонецФункции

Процедура ЗаписатьДанныеАСУТП(ТаблицаДанных, Подключение, ИДСеанса, КоличествоЗагруженныхЗаписей, ДанныеПолучены)

	Если ДанныеПолучены Тогда
				
		НаборЗаписей = РегистрыСведений.торо_ДанныеАСУТП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИДСеанса.Установить(ИДСеанса);
		ТаблицаДанных.ЗаполнитьЗначения(Ложь, "Ошибка");
		ТаблицаДанных.ЗаполнитьЗначения(Ложь, "Обработан");
		ТаблицаДанных.ЗаполнитьЗначения(НачалоЧаса(ТекущаяДата()), "МеткаВремени");
		ТаблицаДанных.ЗаполнитьЗначения(Подключение, "Подключение");

		НомерПП = 1;
		Для Каждого ТекСтрока Из ТаблицаДанных Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ИДСеанса = ИДСеанса;
			НоваяЗапись.ИДЗаписи = НомерПП;
			НомерПП = НомерПП + 1;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
		КонецЦикла;

		КоличествоЗагруженныхЗаписей = КоличествоЗагруженныхЗаписей + НаборЗаписей.Количество();
		НаборЗаписей.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ЗарегистрироватьОшибкуИнтеграции(ТекИсточник, Этап, ОписаниеОшибки, ИДСеанса)

	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(СтрШаблон("Подключение: %1", ТекИсточник.НаименованиеПодключения));
	МассивСтрок.Добавить(СтрШаблон("Сервер: %1", ТекИсточник.Адрес));
	МассивСтрок.Добавить(СтрШаблон("БазаДанных: %1", ТекИсточник.ИмяБД));
	МассивСтрок.Добавить(СтрШаблон("Логин: %1", ТекИсточник.Логин));
	МассивСтрок.Добавить(СтрШаблон("Пароль: %1", ТекИсточник.Пароль));
	МассивСтрок.Добавить(СтрШаблон("ОписаниеОшибки: %1", ОписаниеОшибки));

	ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);

	МенеджерЗаписи = РегистрыСведений.торо_СобытияИнтеграцииСАСУТП.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Подключение = ТекИсточник.Подключение;
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.ИДСеанса = ИДСеанса;
	МенеджерЗаписи.ТипОшибки = Этап;
	МенеджерЗаписи.ТипСобытия = Перечисления.торо_СобытияИнтеграции.Ошибка;
	МенеджерЗаписи.Ошибка = ТекстОшибки;
	МенеджерЗаписи.Записать();

	торо_ОбработкаДанныхАСУТП.СформироватьПочтовыеУведомление(ИДСеанса);

КонецПроцедуры

Функция HTTPЗапросКСервису(ТекстЗапросаЧтения, МассивТегов, ДатаНачала, ДатаОкончания)

	ТекстЗапроса = СтрШаблон("%1?startDate=%2T00:00:00&endDate=%3T00:00:00", ТекстЗапросаЧтения, 
							Формат(ДатаНачала, "ДФ='yyyy-MM-dd'"), Формат(ДатаОкончания, "ДФ='yyyy-MM-dd'"));

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Accept", "application/json");

	Запрос = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивТегов);
	ТекстJSON = ЗаписьJSON.Закрыть();

	Запрос.УстановитьТелоИзСтроки(ТекстJSON);

	Возврат Запрос;

КонецФункции

Функция ЗаполнитьМассивТегов(ПолучениеКП, Подключение)

	МассивТегов = Новый Массив;

	ТекстЗапроса = ТекстЗапросаПолученияТегов();

	Если ПолучениеКП Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Регистр", "РегистрСведений.гкс_ТегиПоказателей");
	Иначе
		ТекстЗапроса =  СтрЗаменить(ТекстЗапроса, "&Регистр", "РегистрСведений.гкс_ТегиНаработки");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Подключение", Подключение);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивТегов.Добавить(Выборка.Тег);
	КонецЦикла;

	Возврат МассивТегов;

КонецФункции

Функция ТекстЗапросаПолученияТегов()

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыРемонта.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОбъектыРемонта
	|ИЗ
	|	РегистрСведений.гкс_ОрганизацииПодключений КАК ОрганизацииПодключений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК ОбъектыРемонта
	|		ПО ОрганизацииПодключений.Подключение = &Подключение
	|		И ОрганизацииПодключений.Организация = ОбъектыРемонта.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Теги.Тег КАК Тег
	|ИЗ
	|	&Регистр КАК Теги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРемонта КАК ВТОбъектыРемонта
	|		ПО Теги.ОР = ВТОбъектыРемонта.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Теги.Тег";

КонецФункции

Процедура СделатьЗаписьВРегистрСеансов(ТекИсточник, КоличествоЗагруженныхЗаписей, ДатаНачалаСеанса)
	МенеджерЗаписи = РегистрыСведений.торо_СеансыОбменаСАСУТП.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Подключение = ТекИсточник.Подключение;
	МенеджерЗаписи.Период = ДатаНачалаСеанса;
	МенеджерЗаписи.КоличествоЗагруженныхЗаписей = КоличествоЗагруженныхЗаписей;
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

#КонецОбласти
